
let answers = [
	[],

	// 質問1
	[
		// 回答1
		{
			eye: { iris: { color: {	r: 200,	g: 200,	b: 200,	},},},
			hair: { iris: { color: {	r: 0,	g: 0,	b: 20,	},},},
		},
		// 回答2
		{
			eye: { iris: { color: {	r: 200,	g: 20,	b: 200,	},},},
		},
		// 回答3
		{
			eye: { iris: { color: {	r: 200,	g: 200,	b: 20,	},},},
		},
		// 回答4
		{
			eye: { iris: { color: {	r: 0,	g: 0,	b: 20,	},},},
		},
	],



	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
		{
			eye: {
				iris: {
					color: {
						r: 200,
						g: 200,
						b: 200,
					},
				},
			},
		},
		{},
		{},
		{},
	],
	[
	],
];
