
let answers = [
	[],

	// 質問1あなたの性別を教えてください
	[
		// 回答1
		{
		},
		// 回答2
		{
		},
		// 回答3
		{
		},
		// 回答4
		{
		},
	],



	// 質問2人は見た目ではなく中身だと思いますか？
	[
		{
			chin: {width: 55},
		},
		{
		},
		{
		},
		{
			chin: {width: rand(-100, 100)},
		},
	],


	// 質問3あなたにとって人生とは退屈なものですか?
	[
		{
		},
		{
			hair: {
				color: {
					r: rand(0, 100),
					g: rand(0, 100),
					b: rand(0, 100),
				},
			},
		},
		{
			hair: {
				color: {
					r: 255,
					g: 255,
					b: 255,
				},
			},
		},
		{
		},
	],


	// 質問4あなたにとって親とはどういう存在ですか?
	[
		{
			eye: { upper_eyeline_cp: { y: -6},},
		},
		{
			eyeblow: { cp: {y:10}, head: { y: -22}, end: { x: -16, y: -41}, },
		},
		{
			lip: { lower: { cp: {height: 24 },}, upper: { cp: {height: 24 },}, },
		},
		{
			mouth: {width: 37, cp: {y: 9},},
			lip: {upper: {cp: {height: 17},}, lower: {cp: {height: 14, width: 10, },},},
		},
	],

	// 質問5普通よりは個性的なほうが良いと思いますか?
	[
		{
			hair: {
				twin_tail: {flag: 1, length: 315, terminal: {x: 22, y: -84},}, 
				front: {flag: 1, type: 2},
			},
		},
		{
			hair: { front: {flag: 1, type: 2},},
		},
		{
			hair: { front: {flag: 0, },},
		},
		{
			hair: { front: {flag: 1, type: 5},},
		},
	],


	// 質問6かわいいよりはキレイな子が好きですか?
	[
		{
			hair: { back: { length: 700}, },
		},
		{
			hair: { back: { length: 400}, },
		},
		{
			hair: { back: { length: rand(0, 900),}, },
		},
		{
			hair: { back: { length: 200}, },
		},
	],

	// 質問19あなたは肉体派ですか？それとも頭脳派ですか?
	[
		{
		},
		{
		},
		{
		},
		{
		},
	],



	// 質問7
	[
		{
			chin: { height: 0},
		},
		{
			chin: { height: 40},
		},
		{
			chin: { height: rand(-10, 10)},
		},
		{
			chin: { height: 80},
		},
	],// 質問8
	[{},{},{},{},],// 質問9
	[{},{},{},{},],// 質問10
	[{},{},{},{},],// 質問11
	[{},{},{},{},],// 質問12
	[{},{},{},{},],// 質問13
	[{},{},{},{},],// 質問14
	[{},{},{},{},],// 質問15
	[{},{},{},{},],// 質問16
	[{},{},{},{},],// 質問17
	[{},{},{},{},],// 質問18
	[{},{},{},{},],// 質問19
	[{},{},{},{},],// 質問20
	[{},{},{},{},],// 質問21
	[{},{},{},{},],// 質問22
	[{},{},{},{},],// 質問23
	[{},{},{},{},],// 質問24
	[{},{},{},{},],// 質問25
	[{},{},{},{},],// 質問26
	[{},{},{},{},],// 質問27
	[{},{},{},{},],// 質問28
	[{},{},{},{},],// 質問29
	[{},{},{},{},],// 質問30
	[{},{},{},{},],// 質問31
	[{},{},{},{},],// 質問32
	[{},{},{},{},],// 質問33
	[{},{},{},{},],// 質問34
	[{},{},{},{},],// 質問35
	[{},{},{},{},],// 質問36
	[{},{},{},{},],// 質問37
	[{},{},{},{},],// 質問38
	[{},{},{},{},],// 質問39
	[{},{},{},{},],// 質問40
];
