
let answers = [
	[],

	// 質問1
	[
		// 回答1
		{
			eye: { iris: { color: {	r: 200,	g: 200,	b: 200,	},},},
		},
		// 回答2
		{
			eye: { iris: { color: {	r: 200,	g: 20,	b: 200,	},},},
		},
		// 回答3
		{
			eye: { iris: { color: {	r: 200,	g: 200,	b: 20,	},},},
		},
		// 回答4
		{
			eye: { iris: { color: {	r: 0,	g: 0,	b: 20,	},},},
		},
	],



	// 質問2
	[
		{
			hair: { front: { flag: 1, type: 2},},
		},
		{
			hair: { front: { flag: 1, type: 5},},
		},
		{
			hair: { front: { flag: 1, type: 0},},
		},
		{
			hair: { front: { flag: 1, type: 0},},
		},
	],


	// 質問3
	[
		{
			hair: { back: { flag: 1, type: 2},},
		},
		{
			hair: { back: { flag: 1, type: 3},},
		},
		{
			hair: { back: { flag: 1, type: 4},},
		},
		{
			hair: { back: { flag: 1, type: 5},},
		},
	],


	// 質問4
	[
		{
			hair: { side: { flag: 1, type: 0},},
		},
		{
			hair: { side: { flag: 1, type: 0},},
		},
		{
			hair: { side: { flag: 0, type: 0},},
		},
		{
			hair: { side: { flag: 0, type: 0},},
		},
	],

	
	[
		{
			eye: {
				size: 20,
				scale: 1.00,
				eye_head: {
					width: 10,
					height: -10,
				},
			},
		},
		{
			eye: {
				size: 30,
				scale: 1.00,
				eye_head: {
					width: 10,
					height: 10,
				},
			},
		},
		{
			eye: {
				size: 24,
				scale: 1.05,
				eye_head: {
					width: 4,
					height: 2,
				},
			},
		},
		{
			eye: {
				size: 22,
				scale: 1.00,
				eye_head: {
					width: 0,
					height: 0,
				},
			},
		},
	],// 質問5


	[
		{
			lip: {
				upper: {
					cp: {
					width: -30,
					height: 30,
					},
				},
			},
		},
		{
			lip: {
				upper: {
					cp: {
					width: 0,
					height: 0,
					},
				},
			},
		},
		{
			lip: {
				upper: {
					cp: {
					width: rand(-10, 10),
					height: rand(-10, 30),
					},
				},
			},
		},
		{
			lip: {
				upper: {
					cp: {
					width: -30,
					height: 30,
					},
				},
			},
		},
	],// 質問6
	[
		{
			hair: { back: { length: 50}, },
		},
		{
			hair: { back: { length: 100}, },
		},
		{
			hair: { back: { length: 150}, },
		},
		{
			hair: { back: { length: 200}, },
		},
	],// 質問7
	[
		{
			chin: { height: 0},
		},
		{
			chin: { height: 40},
		},
		{
			chin: { height: rand(-10, 10)},
		},
		{
			chin: { height: 80},
		},
	],// 質問8
	[{},{},{},{},],// 質問9
	[{},{},{},{},],// 質問10
	[{},{},{},{},],// 質問11
	[{},{},{},{},],// 質問12
	[{},{},{},{},],// 質問13
	[{},{},{},{},],// 質問14
	[{},{},{},{},],// 質問15
	[{},{},{},{},],// 質問16
	[{},{},{},{},],// 質問17
	[{},{},{},{},],// 質問18
	[{},{},{},{},],// 質問19
	[{},{},{},{},],// 質問20
	[{},{},{},{},],// 質問21
	[{},{},{},{},],// 質問22
	[{},{},{},{},],// 質問23
	[{},{},{},{},],// 質問24
	[{},{},{},{},],// 質問25
	[{},{},{},{},],// 質問26
	[{},{},{},{},],// 質問27
	[{},{},{},{},],// 質問28
	[{},{},{},{},],// 質問29
	[{},{},{},{},],// 質問30
	[{},{},{},{},],// 質問31
	[{},{},{},{},],// 質問32
	[{},{},{},{},],// 質問33
	[{},{},{},{},],// 質問34
	[{},{},{},{},],// 質問35
	[{},{},{},{},],// 質問36
	[{},{},{},{},],// 質問37
	[{},{},{},{},],// 質問38
	[{},{},{},{},],// 質問39
	[{},{},{},{},],// 質問40
];
